БухЭксп/Catalogs/CW_КомплектыПечатныхФорм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_КомплектыПечатныхФорм</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СоставКомплекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДокументаКомплекта</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ВидыДокументовКомплекта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодключаемыйОбъект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Enums/CW_ВидыДокументовКомплекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыДокументовКомплекта</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Счет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реализация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетЭкспедитора</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_КомплектыПечатныхФорм/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗначениеОтбора = ПредопределенноеЗначение("Перечисление.CW_ВидыДокументовКомплекта.Счет"); 
	УстановитьОтборСтрок();
	
КонецПроцедуры   

&НаКлиенте
Процедура ЗначениеОтбораПриИзменении(Элемент)
	УстановитьОтборСтрок();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСтрок()
	
	Структура = новый Структура;
	Структура.Вставить("ВидДокументаКомплекта", ЗначениеОтбора);
	
	ОтборСтрок = Новый ФиксированнаяСтруктура(Структура);
	
	Элементы.СоставКомплекта.ОтборСтрок = ОтборСтрок;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомплектаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока и НЕ Копирование Тогда
		ТекущиеДанные = Элементы.СоставКомплекта.ТекущиеДанные;
		ТекущиеДанные.ВидДокументаКомплекта = ЗначениеОтбора;
	КонецЕсли;
	
КонецПроцедуры
